USE [ATK];
GO

IF OBJECT_ID('mis.[Silver_РегистрыСведений.КредитыВТеневыхФилиалах]', 'U') IS NOT NULL
    DROP TABLE mis.[Silver_РегистрыСведений.КредитыВТеневыхФилиалах];
GO

-- Create staging table
CREATE TABLE mis.[Silver_РегистрыСведений.КредитыВТеневыхФилиалах] (
    [КредитыВТеневыхФилиалах Период]      DATETIME NULL,
	[КредитыВТеневыхФилиалах ID]          VARCHAR(36) NOT NULL,
	[КредитыВТеневыхФилиалах Номер Строки] INT NULL,
	[КредитыВТеневыхФилиалах Активность]  VARCHAR(36) NULL,
    [КредитыВТеневыхФилиалах Кредит ID]   VARCHAR(36) NOT NULL,
	[КредитыВТеневыхФилиалах Кредит]      NVARCHAR(100) NULL,
	[КредитыВТеневыхФилиалах Филиал ID]   VARCHAR(36) NOT NULL,
    [КредитыВТеневыхФилиалах Филиал]      NVARCHAR(100) NULL,
	[КредитыВТеневыхФилиалах Кредитный Эксперт ID] VARCHAR(36) NOT NULL,
	[КредитыВТеневыхФилиалах Кредитный Эксперт] NVARCHAR(40) NULL
);
GO

-- Insert data from source table
INSERT INTO mis.[Silver_РегистрыСведений.КредитыВТеневыхФилиалах] 
  (    
    [КредитыВТеневыхФилиалах Период],
	[КредитыВТеневыхФилиалах ID],
	[КредитыВТеневыхФилиалах Номер Строки],
	[КредитыВТеневыхФилиалах Активность],
    [КредитыВТеневыхФилиалах Кредит ID],
	[КредитыВТеневыхФилиалах Кредит],
	[КредитыВТеневыхФилиалах Филиал ID],
    [КредитыВТеневыхФилиалах Филиал],
	[КредитыВТеневыхФилиалах Кредитный Эксперт ID],
	[КредитыВТеневыхФилиалах Кредитный Эксперт]
	)
SELECT
    [КредитыВТеневыхФилиалах Период],
	[КредитыВТеневыхФилиалах ID],
	[КредитыВТеневыхФилиалах Номер Строки],
	[КредитыВТеневыхФилиалах Активность],
    [КредитыВТеневыхФилиалах Кредит ID],
	[КредитыВТеневыхФилиалах Кредит],
	[КредитыВТеневыхФилиалах Филиал ID],
    [КредитыВТеневыхФилиалах Филиал],
	[КредитыВТеневыхФилиалах Кредитный Эксперт ID],
	[КредитыВТеневыхФилиалах Кредитный Эксперт]
FROM [ATK].[dbo].[РегистрыСведений.КредитыВТеневыхФилиалах];
