USE [ATK];
GO

IF OBJECT_ID('mis.[Silver_РегистрыСведений.Валюта]', 'U') IS NOT NULL
    DROP TABLE mis.[Silver_РегистрыСведений.Валюта];
GO

CREATE TABLE mis.[Silver_РегистрыСведений.Валюта]
(
	[Валюта Период]    DATETIME NULL, 
	[Валюта Валюта ID] VARCHAR(36) NOT NULL, 
	[Валюта Валюта]    NVARCHAR(50) NULL,
    [Валюта Курс]      DECIMAL(10, 4) NULL,
	[Валюта Кратность] INT NULL,
	[Валюта Средний Курс] DECIMAL(10, 4) NULL
);
GO

INSERT INTO mis.[Silver_РегистрыСведений.Валюта] 
(
	[Валюта Период],
	[Валюта Валюта ID],
	[Валюта Валюта],
    [Валюта Курс],
	[Валюта Кратность],
	[Валюта Средний Курс]
)
SELECT
	[Валюта Период],
	[Валюта Валюта ID],
	[Валюта Валюта],
    [Валюта Курс],
	[Валюта Кратность],
	[Валюта Средний Курс]
FROM [ATK].[dbo].[РегистрыСведений.Валюта];