USE [ATK];
GO

IF OBJECT_ID('mis.[Silver_Документы.ПротоколКомитета]', 'U') IS NOT NULL
    DROP TABLE mis.[Silver_Документы.ПротоколКомитета];
GO

CREATE TABLE mis.[Silver_Документы.ПротоколКомитета]
(
    [ПротоколКомитета Дата]                DATETIME NULL,
	[ПротоколКомитета Кредит ID]           VARCHAR(36) NOT NULL, 
    [ПротоколКомитета Сумма на Выдачу]	   DECIMAL(15, 2) NULL,
	[ПротоколКомитета Сумма Рефинансирования Кредита] DECIMAL(15, 2) NULL
);
GO

INSERT INTO mis.[Silver_Документы.ПротоколКомитета] 
(
    [ПротоколКомитета Дата],
	[ПротоколКомитета Кредит ID], 
    [ПротоколКомитета Сумма на Выдачу],
	[ПротоколКомитета Сумма Рефинансирования Кредита]
)
SELECT
    [ПротоколКомитета Дата],
	[ПротоколКомитета Кредит ID], 
    [ПротоколКомитета Сумма на Выдачу],
	[ПротоколКомитета Сумма Рефинансирования Кредита]
	
FROM [ATK].[dbo].[Документы.ПротоколКомитета];