USE [ATK];
GO


IF OBJECT_ID('mis.[Silver_Задачи.ЗадачаАдминистратораКредитов.ИсторияСтатусов]', 'U') IS NOT NULL
    DROP TABLE mis.[Silver_Задачи.ЗадачаАдминистратораКредитов.ИсторияСтатусов];
GO

CREATE TABLE mis.[Silver_Задачи.ЗадачаАдминистратораКредитов.ИсторияСтатусов]
(
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов ID] VARCHAR(36) NOT NULL,
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Номер Строки] INT NOT NULL,
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Статус] NVARCHAR(256) NOT NULL,
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Статус ID] VARCHAR(36) NOT NULL,
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Пользователь ID] VARCHAR(36) NOT NULL,
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Пользователь] NVARCHAR(150) NOT NULL,
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Дата Начала] DATETIME NOT NULL,
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Дата Окончания] DATETIME NULL,
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Комментарий] NVARCHAR(1000) NULL,
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Время в Секундах] INT NULL
);
GO

INSERT INTO mis.[Silver_Задачи.ЗадачаАдминистратораКредитов.ИсторияСтатусов]
(
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов ID],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Номер Строки],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Статус],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Статус ID],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Пользователь ID],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Пользователь],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Дата Начала],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Дата Окончания],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Комментарий],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Время в Секундах]
)
SELECT 
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов ID],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Номер Строки],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Статус],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Статус ID],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Пользователь ID],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Пользователь],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Дата Начала],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Дата Окончания],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Комментарий],
    [ЗадачаАдминистратораКредитов.ИсторияСтатусов Время в Секундах]
	
FROM [ATK].[dbo].[Задачи.ЗадачаАдминистратораКредитов.ИсторияСтатусов];
