USE [ATK];
GO

IF OBJECT_ID('mis.[Silver_CommiteeProtocol]', 'U') IS NOT NULL
    DROP TABLE mis.[Silver_CommiteeProtocol];
GO

CREATE TABLE mis.[Silver_CommiteeProtocol]
(
    [ПротоколКомитета Дата]                DATETIME NULL,
	[ПротоколКомитета Дата Решения]        DATETIME NULL,
	[ПротоколКомитета Кредит ID]           VARCHAR(36) NOT NULL,
    [ПротоколКомитета ID]	               VARCHAR(36) NOT NULL,
	[ПротоколКомитета Заявка ID]           VARCHAR(36) NOT NULL,
    [ПротоколКомитета Сумма на Выдачу]	   DECIMAL(15, 2) NULL,
	[ПротоколКомитета Сумма Рефинансирования Кредита] DECIMAL(15, 2) NULL,
	[ПротоколКомитета Назначение Использования Кредита] NVARCHAR(150) NULL,
	[ПротоколКомитета Категория Риска AML]  NVARCHAR(256) NULL,
	[ПротоколКомитета Это Зеленый Кредит] VARCHAR(36) NOT NULL,
	[ПротоколКомитета Комитет]            NVARCHAR(156) NULL,
	[ПротоколКомитета Партнер]  NVARCHAR(256) NULL
	
);
GO

INSERT INTO mis.[Silver_CommiteeProtocol] 
(
    [ПротоколКомитета Дата],
	[ПротоколКомитета Дата Решения],
	[ПротоколКомитета Кредит ID], 
	[ПротоколКомитета ID],
	[ПротоколКомитета Заявка ID],
    [ПротоколКомитета Сумма на Выдачу],
	[ПротоколКомитета Сумма Рефинансирования Кредита],
	[ПротоколКомитета Назначение Использования Кредита],
	[ПротоколКомитета Категория Риска AML],
	[ПротоколКомитета Это Зеленый Кредит],
	[ПротоколКомитета Комитет],
	[ПротоколКомитета Партнер]
)
SELECT
    [ПротоколКомитета Дата],
	[ПротоколКомитета Дата Решения],
	[ПротоколКомитета Кредит ID], 
	[ПротоколКомитета ID],
	[ПротоколКомитета Заявка ID],
    [ПротоколКомитета Сумма на Выдачу],
	[ПротоколКомитета Сумма Рефинансирования Кредита],
	[ПротоколКомитета Назначение Использования Кредита],
	[ПротоколКомитета Категория Риска AML],
	[ПротоколКомитета Это Зеленый Кредит],
	[ПротоколКомитета Комитет],
	[ПротоколКомитета Партнер]
	
FROM [ATK].[mis].[Bronze_Документы.ПротоколКомитета];