USE [ATK];
GO

IF OBJECT_ID('mis.[Silver_РегистрыСведений.СтатусыКредитовВыданных]', 'U') IS NOT NULL
    DROP TABLE mis.[Silver_РегистрыСведений.СтатусыКредитовВыданных];
GO

CREATE TABLE mis.[Silver_РегистрыСведений.СтатусыКредитовВыданных]
( 
    [СтатусыКредитовВыданных Период] DATETIME NULL,
	[СтатусыКредитовВыданных ID] VARCHAR(36) NOT NULL,
	[СтатусыКредитовВыданных Кредит ID] VARCHAR(36) NOT NULL,
	[СтатусыКредитовВыданных Номер Строки] INT NOT NULL,
	[СтатусыКредитовВыданных Активность] VARCHAR(36) NOT NULL,
    [СтатусыКредитовВыданных Статус] NVARCHAR(100) NULL
);
GO

INSERT INTO mis.[Silver_РегистрыСведений.СтатусыКредитовВыданных] 
(
    [СтатусыКредитовВыданных Период],
	[СтатусыКредитовВыданных ID],
	[СтатусыКредитовВыданных Кредит ID],
	[СтатусыКредитовВыданных Номер Строки],
	[СтатусыКредитовВыданных Активность],
    [СтатусыКредитовВыданных Статус]             
)
SELECT
    [СтатусыКредитовВыданных Период],
	[СтатусыКредитовВыданных ID],
	[СтатусыКредитовВыданных Кредит ID],
	[СтатусыКредитовВыданных Номер Строки],
	[СтатусыКредитовВыданных Активность],
    [СтатусыКредитовВыданных Статус]  
FROM [ATK].[dbo].[РегистрыСведений.СтатусыКредитовВыданных];

