USE [ATK];
GO

IF OBJECT_ID('mis.[Bronze_Справочники.ФилиалыКонтрагентов]', 'U') IS NOT NULL
    DROP TABLE mis.[Bronze_Справочники.ФилиалыКонтрагентов];
GO

CREATE TABLE mis.[Bronze_Справочники.ФилиалыКонтрагентов]
(
    [ФилиалыКонтрагентов ID]               VARCHAR(36)   NOT NULL, 
    [ФилиалыКонтрагентов Пометка Удаления] VARCHAR(36)   NOT NULL,
    [ФилиалыКонтрагентов Владелец]         VARCHAR(36)   NOT NULL,
    [ФилиалыКонтрагентов Код]              NVARCHAR(3)   NOT NULL,
    [ФилиалыКонтрагентов Наименование]     NVARCHAR(150) NULL,
    [ФилиалыКонтрагентов Адрес]            NVARCHAR(100) NULL

);
GO

INSERT INTO mis.[Bronze_Справочники.ФилиалыКонтрагентов] 
(
    [ФилиалыКонтрагентов ID],
    [ФилиалыКонтрагентов Пометка Удаления],
    [ФилиалыКонтрагентов Владелец],
    [ФилиалыКонтрагентов Код],
    [ФилиалыКонтрагентов Наименование],
    [ФилиалыКонтрагентов Адрес]

)
SELECT
    [ФилиалыКонтрагентов ID],
    [ФилиалыКонтрагентов Пометка Удаления],
    [ФилиалыКонтрагентов Владелец],
    [ФилиалыКонтрагентов Код],
    [ФилиалыКонтрагентов Наименование],
    [ФилиалыКонтрагентов Адрес]
	
FROM [ATK].[dbo].[Справочники.ФилиалыКонтрагентов];

