USE [ATK];
GO

IF OBJECT_ID('mis.[Bronze_Документы.ПротоколКомитета]', 'U') IS NOT NULL
    DROP TABLE mis.[Bronze_Документы.ПротоколКомитета];
GO

CREATE TABLE mis.[Bronze_Документы.ПротоколКомитета]
(
    [ПротоколКомитета Дата]                DATETIME NULL,
	[ПротоколКомитета Дата Решения]        DATETIME NULL,
	[ПротоколКомитета Кредит ID]           VARCHAR(36) NOT NULL,
    [ПротоколКомитета ID]	               VARCHAR(36) NOT NULL,
	[ПротоколКомитета Заявка ID]           VARCHAR(36) NOT NULL,
    [ПротоколКомитета Сумма на Выдачу]	   DECIMAL(15, 2) NULL,
	[ПротоколКомитета Сумма Рефинансирования Кредита] DECIMAL(15, 2) NULL
);
GO

INSERT INTO mis.[Bronze_Документы.ПротоколКомитета] 
(
    [ПротоколКомитета Дата],
	[ПротоколКомитета Дата Решения],
	[ПротоколКомитета Кредит ID], 
	[ПротоколКомитета ID],
	[ПротоколКомитета Заявка ID],
    [ПротоколКомитета Сумма на Выдачу],
	[ПротоколКомитета Сумма Рефинансирования Кредита]
)
SELECT
    [ПротоколКомитета Дата],
	[ПротоколКомитета Дата Решения],
	[ПротоколКомитета Кредит ID], 
	[ПротоколКомитета ID],
	[ПротоколКомитета Заявка ID],
    [ПротоколКомитета Сумма на Выдачу],
	[ПротоколКомитета Сумма Рефинансирования Кредита]
	
FROM [ATK].[dbo].[Документы.ПротоколКомитета];