USE [ATK];
SET NOCOUNT ON;
SET XACT_ABORT ON;

IF OBJECT_ID(N'[mis].[Bronze_РегистрыСведений.СведенияОПрочихДоходахКлиента]', N'U') IS NOT NULL
    DROP TABLE [mis].[Bronze_РегистрыСведений.СведенияОПрочихДоходахКлиента];

CREATE TABLE [mis].[Bronze_РегистрыСведений.СведенияОПрочихДоходахКлиента] 
(
      [Период]                          DATETIME2      NULL,
      [Клиент Tип]                      VARCHAR(36)    NULL,
      [Клиент Вид]                      VARCHAR(36)    NULL,
      [Клиент _TRef]                    NVARCHAR(256)  NULL,
      [Клиент ID]                       VARCHAR(36)    NULL,
      [Вид Дохода]                      NVARCHAR(256)  NULL,
      [Служебное]                       NUMERIC(10,0)  NULL,
      [Сумма]                           NUMERIC(15,2)  NULL,
      [Официальный]                     VARCHAR(36)    NULL,
      [Подтвержденный Доход Месяц]      NUMERIC(15,2)  NULL,
      [Подтвержденный Доход Год]        NUMERIC(15,2)  NULL,
      [Валюта ID]                       VARCHAR(36)    NULL,
      [Валюта]                          NVARCHAR(50)   NULL,
      [Страна ID]                       VARCHAR(36)    NULL,
      [Страна]                          NVARCHAR(30)   NULL,
      [Не Получает]                     VARCHAR(36)    NULL,
      [Сектор Экономики ID]             VARCHAR(36)    NULL,
      [Сектор Экономики]                NVARCHAR(150)  NULL,
      [Комментарий]                     NVARCHAR(1024) NULL,
      [Источник Кредитной Истории]      NVARCHAR(256)  NULL,
      [В Ожидании]                      VARCHAR(36)    NULL,
      [Дата Изменения]                  DATETIME2      NULL,
      [Источник Tип]                    VARCHAR(36)    NULL,
      [Источник Вид]                    VARCHAR(36)    NULL,
      [Источник _TRef]                  NVARCHAR(256)  NULL,
      [Источник ID]                     VARCHAR(36)    NULL,
      [Ответственный ID]                VARCHAR(36)    NULL,
      [Ответственный]                   NVARCHAR(100)  NULL,
      [Состояние Записи]                NUMERIC(1,0)   NULL
);
GO

INSERT INTO [mis].[Bronze_РегистрыСведений.СведенияОПрочихДоходахКлиента]
SELECT
      [СведенияОПрочихДоходахКлиента Период]                               AS [Период],
      [СведенияОПрочихДоходахКлиента Клиент Tип]                           AS [Клиент Tип],
      [СведенияОПрочихДоходахКлиента Клиент Вид]                           AS [Клиент Вид],
      [СведенияОПрочихДоходахКлиента Клиент _TRef]                         AS [Клиент _TRef],
      [СведенияОПрочихДоходахКлиента Клиент ID]                            AS [Клиент ID],
      [СведенияОПрочихДоходахКлиента Вид Дохода]                           AS [Вид Дохода],
      [СведенияОПрочихДоходахКлиента Служебное]                            AS [Служебное],
      [СведенияОПрочихДоходахКлиента Сумма]                                AS [Сумма],
      [СведенияОПрочихДоходахКлиента Официальный]                          AS [Официальный],
      [СведенияОПрочихДоходахКлиента Подтвержденный Доход Месяц]           AS [Подтвержденный Доход Месяц],
      [СведенияОПрочихДоходахКлиента Подтвержденный Доход Год]             AS [Подтвержденный Доход Год],
      [СведенияОПрочихДоходахКлиента Валюта ID]                            AS [Валюта ID],
      [СведенияОПрочихДоходахКлиента Валюта]                               AS [Валюта],
      [СведенияОПрочихДоходахКлиента Страна ID]                            AS [Страна ID],
      [СведенияОПрочихДоходахКлиента Страна]                               AS [Страна],
      [СведенияОПрочихДоходахКлиента Не Получает]                          AS [Не Получает],
      [СведенияОПрочихДоходахКлиента Сектор Экономики ID]                  AS [Сектор Экономики ID],
      [СведенияОПрочихДоходахКлиента Сектор Экономики]                     AS [Сектор Экономики],
      [СведенияОПрочихДоходахКлиента Комментарий]                          AS [Комментарий],
      [СведенияОПрочихДоходахКлиента Источник Кредитной Истории]           AS [Источник Кредитной Истории],
      [СведенияОПрочихДоходахКлиента В Ожидании]                            AS [В Ожидании],
      [СведенияОПрочихДоходахКлиента Дата Изменения]                       AS [Дата Изменения],
      [СведенияОПрочихДоходахКлиента Источник Tип]                         AS [Источник Tип],
      [СведенияОПрочихДоходахКлиента Источник Вид]                         AS [Источник Вид],
      [СведенияОПрочихДоходахКлиента Источник _TRef]                       AS [Источник _TRef],
      [СведенияОПрочихДоходахКлиента Источник ID]                          AS [Источник ID],
      [СведенияОПрочихДоходахКлиента Ответственный ID]                     AS [Ответственный ID],
      [СведенияОПрочихДоходахКлиента Ответственный]                        AS [Ответственный],
      [СведенияОПрочихДоходахКлиента Состояние Записи]                     AS [Состояние Записи]
	  
FROM [ATK].[dbo].[РегистрыСведений.СведенияОПрочихДоходахКлиента];